{
    "name": "Trait challenge",
    "code": "traits",
    "hasWheel": true,
    "hasDuplicates": false,
    "desc": "The famous Phasmophobia Trait Challenge, created by Destiny. See the rules at his website: https://www.dposofficial.com/phasmophobiatraitschallenge.html",
    "wheel":{
        "Archaeologist": "This player must find the bone as a priority. They cannot do anything else until they take a successful picture of it and pick it up.",
        "Asthmatic": "This player cannot use the smudge sticks due to their weak lungs.",
        "Atmospheric": "This player can ONLY use the candle or lighter for light.",
        "Audiophile": "This player must have the Parabolic Microphone on them at all times.",
        "Auditor": "This player must place down at least 4 sensors throughout the game. You can bring other items in and place them one at a time, or you can place down multiple at once. You can still use other items as long as you place down 4 sensors and detect a ghost with one.",
        "Back pain": "This player must be crouched at all times after the truck door is opened.",
        "Bard": "This player must be singing everything in song they say. INCLUDING DURING HUNTS!",
        "Bartender": "This player must bring at least 3 drinks (Bottles, Cans, or Cups) found on the map to the ghost room once it's found.",
        "Chatterbox": "This player must have their radio on at all times. Radio must always be on during hunts as well. No Proximity Chat is allowed and they can not turn off their radio when attempting to use the Spirit Box, Ouija Board, or generally talking to the ghost.",
        "Chef": "This player must bring at least 3 plates found on the map to the ghost room once found.",
        "Cinematographer": "This player is obsessed with cameras. They cannot use any other items besides the Photo Camera and Video Cameras. They're also the only person who can check Cams in the van. All other players are banned from viewing the Camera Monitor in the van even after the person with this trait dies.",
        "Claustrophobic": "This player does not like small tight spaces... Thanks to this, they can no longer hide in lockers or closets and can't use them as hiding spots.",
        "Clumsy": "This player must drop ALL their items every time a hunt begins if they're inside the building. If the player is outside when a hunt begins, they do not have to drop their items.",
        "Control": "This player must act as the control tower and stay in the truck for the duration of the mission. They can not leave the van AT ALL. NOTE: If this becomes a stacked trait or another player has the Cinematographer trait, spin again)",
        "Courteous": "This player must close every door they pass through behind them. Including during Hunts.",
        "Coward": "Every time the player experiences a ghost event (Ghost Hissing in Ear/Ghost Appearing in front of them), they must leave the building immediately and stay in the truck until the end of the next hunt.",
        "Deaf": "This player must take off their headphones or make it where they cannot hear the game. No sound allowed for them. NOTE: If the player already has the Mute Trait assigned to them, spin again.",
        "Disorientated": "This player must wear their headphones on opposite ears and have hearing reversed. NOTE: If the player is using VR, and is unable to remove their headphones from their headset, they are given the Deaf trait instead.",
        "Forgetful": "Three random equipment items have been forgotten by this player back at the Lobby. These items are banned and cannot be used during the mission. Spin the Items wheel to decide which items were forgotten. (The wheel is under the traits wheel on this page)",
        "Gamer": "This player must always stop at any computer in sight (except the computer in the truck) and stay at it for 10 seconds in order to keep their right as a gamer. This includes during hunts!",
        "Germaphobe": "This player must wash their hands and sing their ABCs every time they pass a sink or a room containing a sink. This includes DURING HUNTS!",
        "Ghost Bait": "This player just wants to end it all. They must die by the ghost first. If they aren't the first ones to die, they fail the trait automatically. The player don't have to buy items.",
        "Impulsive": "When this player experiences a ghost event (Ghost Hissing in Ear/Ghost Appearing in front of them) the person must drop what ever item is in their hand out of fear. Thanks to them dropping it, it's now broken and can't be used anymore on the mission by everyone.",
        "Inconsiderate": "Every door this player passes though must be left wide open. INCLUDING DURING HUNTS!",
        "Inquisitive": "If the Ouija Board is found, the player immediately has to use it until they get a successful answer. NOTE: If the Ouija board is not found, the person who has this trait must survive until the end and cannot die.",
        "Insane": "If the Ouija Board is found, the player must continuously use it until their sanity is at 0%. If no Ouija Board is found, they must stay inside until their sanity is at 0%.",
        "Limited Vocabulary": "This player can only speak in phrases containing 5 words. No more, no less. Every time they say something, it has to be 5 words!",
        "Loud Mouth": "This player must always yell at the ghost when near it or inside the ghost room. Either continuously say it's name, ask for signs, etc. THIS INCLUDES DURING HUNTS!",
        "Malfunction": "This player cannot communicate by their radio as it's malfunctioned for them. They can hear others but not broadcast their own voice.",
        "Mute": "This player cannot communicate using their voice. They must stay silent the entire mission. NOTE: Messaging on Discord/Steam/other means is breaking this rule and automatically fails this trait. NOTE #2: If the player already has the Deaf Trait assigned to them, spin again.",
        "Nyctophobic": "This player enjoys the light. Any room this player is in has to be on along with the breaker. If the breaker turns off with the lights in this player's room, they must stand still until someone else turns on the breaker.",
        "Painter": "This player enjoys painting. For this reason, they must grab 3 spray cans and bring them to the ghost room.",
        "Paranoid": "This player cannot hide in the same place more than once. (This includes hiding behind furniture, inside lockers/closets, and rooms.)",
        "Perceptive": "This player must only use their ears and eyes to find and locate the ghost room. They are not allowed to use any of the evidence gathering equipment until the room is identified.",
        "Pharmacophobia": "This player doesn't believe in medicine. They cannot take any sanity pills during the whole mission.",
        "Photophobic": "This player doesn't like wasting electricity. The breaker has to be off at all times due to this player. No lights in any of the rooms.  If the ghost turns on the breaker,  TURN OFF THE BREAKER IMMEDIATELY!!!",
        "Raver": "This player loves raves. They are ONLY allowed to use the glow sticks as a light source. The player has the right to blast music when they want",
        "Religious": "This player can not be in the same room as the Ouija Board and must have Crucifix on them at all times. If the ghost is found to be a Demon or if the Crucifix breaks fully in the player's hand, they must leave immediately and stay in the truck for the rest of the mission.",
        "Rushed": "This player must act as if they're in a rush to get out of there fast, not wanting to hunt any ghosts. All Optional Objectives are voided and players do not have to do them. Thus, making it easier for everyone to pass. However, passing this mission does not allow your team to spin the bonus wheel for the next mission.",
        "Scaredy Cat": "This player doesn't like to be alone at all when they're inside. They must always accompany someone else on the mission. If their companion dies, another person must come out and get them. If they're the last player on the mission, they must head straight back to the truck and figure out the ghost themselves.",
        "Shut In": "This player likes being inside. Once they've entered the building, they must stay inside until the ghost type has been found as well as two of the three objectives completed.",
        "Shy": "This player doesn't want to talk to the ghost. They're not allowed to talk to the ghost, say the ghost's name, any trigger words/phrases, or use the Spirit Box & Ouija Board.",
        "Small Pockets": "This player decided to wear girl's pants. They can only carry two items maximum! (They are allowed to put on head cams as they don't contribute to inventory space)",
        "Thief": "This player must collect at least three framed pictures or electronics on the map and return them to the truck... Got to make more money some how right?",
        "Unprepared": "This player must run into the building with no items as soon as the truck door opens. In order to become useful and begin using items, they must experience a ghost event or hunt.",
        "Useless": "This player can not use any evidence gathering equipment during the whole mission. (Thermometer, Spirit Box, UV Light/Glow Sticks, Video Cameras/Head Cams, & EMF Reader)",
        "UV Expert": "This player can ONLY use the UV torch for ligh",
        "Vampire": "This player enjoys the vast darkness. Flashlights or any items that are a light source cannot be used by this player. If the lights are on in this players room, they must stand still until someone else turns off the breaker.",
        "Weak Bladder": "This player must use and flush a toilet every time they directly pass a room with a toilet in it. NOTE: If your group is playing on a map with multiple bathrooms next to each other (ex. High School), you only have to flush one toilet in one of the bathrooms every pass.",
        "Young At Heart": "This player must rescue at least 2 stuffed toys found inside and bring them back out to the truck. Voodoo Dolls do not count! NOTE: If this is a trait for someone in your group, make sure you play on a map you know spawns stuffed animals. If your group has already chosen the map and it doesn't spawn any stuffed animals, your trait is automatically failed and rolled over into the next mission."
    }
}
